In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame({"Categoria": ['A', 'A', 'B', 'B', 'C'],
                   "X": [13, 23, 18, 33, 48],
                   "Y": [17, 27, 22, 37, 52]})

In [5]:
df

  Categoria   X   Y
0         A  13  17
1         A  23  27
2         B  18  22
3         B  33  37
4         C  48  52

In [8]:
df['X_1'] = df['X'].shift(1)

In [9]:
df

  Categoria   X   Y   X_1
0         A  13  17   NaN
1         A  23  27  13.0
2         B  18  22  23.0
3         B  33  37  18.0
4         C  48  52  33.0

In [11]:
df['X_1'] = df.groupby('Categoria')['X'].shift(1)

In [12]:
df

  Categoria   X   Y   X_1
0         A  13  17   NaN
1         A  23  27  13.0
2         B  18  22   NaN
3         B  33  37  18.0
4         C  48  52   NaN